---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PrimaryOptionId
source: html/8a8ce8f6-3c03-92fd-3e98-1094a4b006a9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PrimaryOptionId Property

"Primary Option Id"

## Syntax (C#)
```csharp
public static ForgeTypeId PrimaryOptionId { get; }
```